In [47]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import MinMaxScaler
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score

In [25]:
data=pd.read_csv("Mall_Customers.csv")

In [26]:
data

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [28]:
data.drop(columns="CustomerID",axis=1,inplace=True)

In [29]:
data["Gender"]=(data["Gender"]=="Male").astype("int8")

In [30]:
data

     Gender  Age  Annual Income (k$)  Spending Score (1-100)
0         1   19                  15                      39
1         1   21                  15                      81
2         0   20                  16                       6
3         0   23                  16                      77
4         0   31                  17                      40
..      ...  ...                 ...                     ...
195       0   35                 120                      79
196       0   45                 126                      28
197       1   32                 126                      74
198       1   32                 137                      18
199       1   30                 137                      83

[200 rows x 4 columns]

In [38]:
scaler=MinMaxScaler()
data_sc = pd.DataFrame(scaler.fit_transform(data),columns=data.columns,index=data.index)
data_sc

     Gender       Age  Annual Income (k$)  Spending Score (1-100)
0       1.0  0.019231            0.000000                0.387755
1       1.0  0.057692            0.000000                0.816327
2       0.0  0.038462            0.008197                0.051020
3       0.0  0.096154            0.008197                0.775510
4       0.0  0.250000            0.016393                0.397959
..      ...       ...                 ...                     ...
195     0.0  0.326923            0.860656                0.795918
196     0.0  0.519231            0.909836                0.275510
197     1.0  0.269231            0.909836                0.744898
198     1.0  0.269231            1.000000                0.173469
199     1.0  0.230769            1.000000                0.836735

[200 rows x 4 columns]

In [46]:
model=KMeans(n_clusters=5,random_state=0)
clusters=model.fit_predict(data_sc)
data_sc["Cluster"]=clusters
data_sc

     Gender       Age  Annual Income (k$)  Spending Score (1-100)  Cluster
0       1.0  0.019231            0.000000                0.387755        2
1       1.0  0.057692            0.000000                0.816327        2
2       0.0  0.038462            0.008197                0.051020        1
3       0.0  0.096154            0.008197                0.775510        3
4       0.0  0.250000            0.016393                0.397959        3
..      ...       ...                 ...                     ...      ...
195     0.0  0.326923            0.860656                0.795918        3
196     0.0  0.519231            0.909836                0.275510        1
197     1.0  0.269231            0.909836                0.744898        2
198     1.0  0.269231            1.000000                0.173469        4
199     1.0  0.230769            1.000000                0.836735        2

[200 rows x 5 columns]

In [50]:
score=silhouette_score(data_sc, labels=model.labels_, random_state=0)
score

0.7317811788582591